# усі параметри задаються користувачем (n, m)
# для такої простої програми допускається використання змінних n, m
# однак при маштабуванні ліпше вказувати імена згідно контексту

# окреме дякую за коментарі
# єдине, бажано одразу намагатися їх писати англійською

# початок проміжку
n = 5
# кінець проміжку
m =15
# цикл для виконання перебору значення. Збільшення +1
for number in range(n , m + 1):
    # умова для вирахування чи парне або непарне число
    if number % 2 == 0:
        print('Число є парним {0}'.format(number))
    else:
        print('Число є непарним {0}'.format(number))
